#pragma once


//**************************************************************************************************************************************************************
//		インクルードファイル
//**************************************************************************************************************************************************************
#include "StdAfx.h"
#include <d3d9.h>
#include <spine/spine.h>


//**************************************************************************************************************************************************************
//		テクスチャーローダークラス
//**************************************************************************************************************************************************************
class CDX9TextureLoader : public spine::TextureLoader
{
public:
							CDX9TextureLoader() : m_pD3DDev( nullptr ){}


public:
	bool					Init( LPDIRECT3DDEVICE9 pD3DDev );


public:
	void					load( spine::AtlasPage &page, const spine::String &path ) override;
	void					unload( void* texture ) override;
	//String				toString() const;


private:
	LPDIRECT3DDEVICE9		m_pD3DDev;

};


